app/Http/Controllers/User/UserBoardController.php

SELECT * FROM `boards`
---
    public function index()
    {
        return view('user.userboard.index',
            [
                'boards' => Board::all()
            ]
        );