app/Http/Controllers/User/UserLoginController.php

    public function register()
    {
        return view('user.userlogin.register',
        [
            'title' => 'User Register',
            'active' => 'userregister',
            'divisi' => Divisi::all()
---
SELECT * FROM `divisis`