app/Http/Controllers/User/UserController.php

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'konten' => 'required',
            'board_id' => 'required',
            'detail' => 'required',
            'deadline' => 'required'
        ]);

        $validatedData['user_id'] = auth()->user()->id;
        $validatedData['status'] = 'Pending';
        Req::create($validatedData);
---
INSERT INTO `reqs` (`konten`, `board_id`, `detail`, `deadline`, `user_id`, `status`, `updated_at`, `created_at`) VALUES ('coming soon', '4', 'feeds 3x3', '2024-09-02', 4, 'Pending', '2023-06-05 08:13:20', '2023-06-05 08:13:20')

    public function edit(Req $req)
    {
        return view('user.userreq.edit',
        [
            'title' => 'User Request',
            'active' => 'userreq',
            'boards' => Board::all(),
---
SELECT * FROM `boards`