app/Http/Controllers/User/UserController.php

    public function index()
    {
        return view('user.userreq.index',
        [
            'title' => 'User Request',
            'active' => 'userreq',
            // this users request is all the requests that has the same user_id as the user we are viewing
            'requests' => Req::where('user_id', auth()->user()->id)->get()
---
SELECT * FROM `reqs` WHERE `user_id` = 1

    public function create()
    {
        return view('user.userreq.create',
        [
            'title' => 'User Request',
            'active' => 'userreq',
            'boards' => Board::all()
---
SELECT * FROM `boards`

    public function edit(Req $req)
    {
        return view('user.userreq.edit',
        [
            'title' => 'User Request',
            'active' => 'userreq',
            'boards' => Board::all(),
            'request' => $req
        ]);
---
SELECT * FROM `boards`

    public function update(Request $request, Req $req)
    {
        $validatedData = $request->validate([
            'konten' => 'required',
            'board_id' => 'required',
            'detail' => 'required',
            'deadline' => 'required'
        ]);

        $validatedData['user_id'] = auth()->user()->id;
        $validatedData['status'] = 'pending';
        Req::where('id', $req->id)->update($validatedData);
---
UPDATE `reqs` SET `konten` = 'coming soon', `board_id` = '2', `detail` = 'feeds ig 3x3', `deadline` = '2023-05-18', `user_id` = 1, `status` = 'pending', `reqs`.`updated_at` = '2023-05-08 08:27:14' WHERE `id` = 12