app/Http/Controllers/UserBoardController.php

    public function index()
    {
        return view('user.userboard.index',
            [
                'boards' => Board::all()
            ]
        );
---
SELECT * FROM `boards`