app/Http/Controllers/UserController.php

SELECT * FROM `reqs` WHERE `user_id` = 2
---
    public function index()
    {
        return view('user.userreq.index',
        [
            'title' => 'User Request',
            'active' => 'userreq',
            // this users request is all the requests that has the same user_id as the user we are viewing
            'requests' => Req::where('user_id', auth()->user()->id)->get()

SELECT * FROM `boards`
---
    public function edit(Req $req)
    {
        return view('user.userreq.edit',
        [
            'title' => 'User Request',
            'active' => 'userreq',
            'boards' => Board::all(),
            'request' => $req
        ]);

SELECT * FROM `reqs` WHERE `id` in (3)
---
    public function update(Request $request, Req $req)
    {
        $validatedData = $request->validate([
            'konten' => 'required',
            'board_id' => 'required',
            'detail' => 'required',
            'deadline' => 'required'
        ]);

        $validatedData['user_id'] = auth()->user()->id;
        $validatedData['status'] = 'pending';
        Req::where('id', $req->id)->update($validatedData);