app/Http/Controllers/UserController.php

DELETE FROM `reqs` WHERE `id` = 3
---
    public function destroy(Req $req)
    {
        Req::destroy($req->id);