app/Http/Controllers/Admin/AdminController.php

SELECT * FROM `reqs`
---
    public function index()
    {
        return view('admin.adminreq.index',
        [
            'title' => 'User Request',
            'active' => 'userreq',
            // this users request is all the requests that has the same user_id as the user we are viewing
            'requests' => Req::all()

UPDATE `admins` SET `photo` = 'uploads/0045ldJKkqje1RvdMLTAo0YcY6crvhly9QJGOf0Y.png', `admins`.`updated_at` = '2023-06-02 08:10:26' WHERE `id` = 1
---
    public function updatephoto(Request $request, Admin $admin)
    {
        $validatedData = $request->validate([
            'photo' => 'required|image|mimes:jpeg,png,jpg,gif,svg|max:2048',
        ]);

        $validatedData['photo'] = $request->file('photo')->store('uploads', 'public');

        // update corresponding admins photo attribute
        Admin::where('id', $admin->id)->update($validatedData);

INSERT INTO `p_i_c_s` (`req_id`, `admin_id`, `updated_at`, `created_at`) VALUES (, 1, '2023-05-22 06:25:06', '2023-05-22 06:25:06')
UPDATE `reqs` SET `status` = 'On Progress', `reqs`.`updated_at` = '2023-06-05 08:34:06' WHERE `id` = 14
SELECT * FROM `reqs` WHERE `id` in (5)
---
    public function take(Req $req)
    {
        $validatedData['req_id'] = $req->id;
        $validatedData['admin_id'] = auth()->guard('admin')->user()->id;
        PIC::create($validatedData);

        Req::where('id', $req->id)->update(['status' => 'on progress']);

UPDATE `reqs` SET `status` = 'On Progress', `reqs`.`updated_at` = '2023-06-05 04:41:39' WHERE `id` = 3
---
    public function update(Request $request, Req $req)
    {
        $validatedData = $request->validate([
            'status' => 'required',
        ]);

        $validatedData['user_id'] = $req->user_id;
        $validatedData['board_id'] = $req->board_id;
        $validatedData['konten'] = $req->konten;
        $validatedData['detail'] = $req->detail;
        $validatedData['deadline'] = $req->deadline;


        Req::where('id', $req->id)->update($validatedData);