app/Http/Controllers/Admin/AdminController.php

    public function destroy(Req $req)
    {
        Req::destroy($req->id);
---
DELETE FROM `reqs` WHERE `id` = 5