app/Http/Controllers/Admin/AdminBoardController.php

SELECT * FROM `boards`
---
    public function index()
    {
        return view('admin.adminboard.index',
            [
                'boards' => Board::all()
            ]
        );

INSERT INTO `boards` (`name`, `created_at`, `updated_at`) VALUES ('website', '2023-06-05 09:34:08', '2023-06-05 09:34:08')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'name' => 'required|max:255',
        ]);
        $validatedData['created_at'] = now();

        Board::create($validatedData);